various/230428_compare_server_performance/go_nethttp/test_230505_01_autocannon.txt

autocannon -c 100 -d 5 -p 10 http://127.0.0.1:5000/

================================================================================

┌─────────┬───────┬───────┬───────┬───────┬──────────┬─────────┬────────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5% │ 99%   │ Avg      │ Stdev   │ Max    │
├─────────┼───────┼───────┼───────┼───────┼──────────┼─────────┼────────┤
│ Latency │ 17 ms │ 22 ms │ 54 ms │ 78 ms │ 24.59 ms │ 10.9 ms │ 181 ms │
└─────────┴───────┴───────┴───────┴───────┴──────────┴─────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 31743   │ 31743   │ 42207   │ 44511   │ 40273.6 │ 4661.31 │ 31730   │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 3.81 MB │ 3.81 MB │ 5.06 MB │ 5.34 MB │ 4.83 MB │ 559 kB  │ 3.81 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 5

202k requests in 5.25s, 24.2 MB read

================================================================================
Run again

http://127.0.0.1:5000/
Running 5s test @ http://127.0.0.1:5000/
100 connections with 10 pipelining factor

┌─────────┬───────┬───────┬───────┬───────┬──────────┬──────────┬────────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5% │ 99%   │ Avg      │ Stdev    │ Max    │
├─────────┼───────┼───────┼───────┼───────┼──────────┼──────────┼────────┤
│ Latency │ 17 ms │ 22 ms │ 54 ms │ 66 ms │ 24.61 ms │ 10.16 ms │ 193 ms │
└─────────┴───────┴───────┴───────┴───────┴──────────┴──────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 28831   │ 28831   │ 43039   │ 43807   │ 40305.6 │ 5764.64 │ 28830   │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 3.46 MB │ 3.46 MB │ 5.17 MB │ 5.26 MB │ 4.84 MB │ 691 kB  │ 3.46 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 5

203k requests in 5.11s, 24.2 MB read

================================================================================

How does net/http compares to go fiber?

let's compare latency median:
- go net/http    22ms
- go fiber       28ms
go fiber and go net/http are pretty similar, there is not statistical difference 

let's compare req/s median:
- go net/http    43039
- go fiber       35007
go fiber is slightly worse, but the statistical difference is not very large

let's compare throughput (bytes/s) median:
- go net/http    5170 kB
- go fiber       4130 kB
go net/http is slightly better in terms of throughput too