various/230428_compare_server_performance/go_nethttp/test_230513_another_test.txt

autocannon -c 100 -d 5 -p 10 http://127.0.0.1:5000/

================================================================================

Running 5s test @ http://127.0.0.1:5000/
100 connections with 10 pipelining factor

┌─────────┬───────┬───────┬───────┬───────┬──────────┬──────────┬────────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5% │ 99%   │ Avg      │ Stdev    │ Max    │
├─────────┼───────┼───────┼───────┼───────┼──────────┼──────────┼────────┤
│ Latency │ 18 ms │ 25 ms │ 57 ms │ 78 ms │ 27.18 ms │ 11.71 ms │ 203 ms │
└─────────┴───────┴───────┴───────┴───────┴──────────┴──────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬──────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg      │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼──────────┼─────────┼─────────┤
│ Req/Sec   │ 29871   │ 29871   │ 36575   │ 42719   │ 36564.81 │ 4090.34 │ 29860   │
├───────────┼─────────┼─────────┼─────────┼─────────┼──────────┼─────────┼─────────┤
│ Bytes/Sec │ 3.58 MB │ 3.58 MB │ 4.39 MB │ 5.13 MB │ 4.39 MB  │ 492 kB  │ 3.58 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴──────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 5

184k requests in 5.13s, 21.9 MB read

================================================================================

let's compare latency median:
- go fiber          28ms
- go net/http       22ms
- go net/http 2nd   25ms
- flask gunicorn  2466ms
- rust actix        31ms

let's compare req/s median:
- go fiber           35007
- go net/http        43039
- go net/http 2nd    36575
- flask gunicorn      2091
- rust actix         32927


let's compare throughput (bytes/s) median:
- go fiber          4130 kB
- go net/http       5170 kB
- go net/http 2nd   4390 kB
- flask gunicorn     341 kB
- rust actix        3060 kB